---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.IPerformanceAdviserRule
source: html/a8c62646-3057-326e-6afa-be7784228e30.htm
---
# IPerformanceAdviserRule Members

Invoked by performance advisor for each element to be checked.